"""
    实参传递方式
"""


def fun1(a, b, c):
    print('a=', a, end=' ')
    print('b=', b, end=' ')
    print('c=', c)


# 位置传参:实参与形参的位置依次对应
fun1(1, 2, 3)
print()
# 关键字传参:实参根据形参的名字进行对应
fun1(b=1, c=2, a=3)
print()

# 序列传参:实参用*将序列拆解后与形参的位置依次对应
fun1(*[1,2,3])
fun1(*'312')
fun1(*(4,5,6))
fun1(*{7,8,9})
fun1(*{'a':6,'b':7,'c':8}) #以字典的键组成的集合的序列
fun1(*{'a','b','c'})
# 字典传参用**将字典拆解
fun1(**{'a':6,'b':7,'c':8})
print()

# 默认(缺省)参数
def fun2(a=0,b=1,c=2):
    print('a=', a, end=' ')
    print('b=', b, end=' ')
    print('c=', c)

fun2(b=1)
